Repository: AlertaDengue/PySUS
Catalog: docs/source/locale/*/LC_MESSAGES/IBGE_data.po
Languages: pt

source: Obtaining data from IBGE
pt: Extraindo dados do IBGE

source: Listing Subject Areas
pt: Listando Grupos de dados

source: IBGE makes available data from a number of surveys on different subjects. We can find out what is available, before downloading data.
pt: O IBGE disponibiliza dados de várias pesquisas sobre diferentes assuntos. Podemos descobrir o que está disponível antes de baixar os dados.

source: Let's look at the datasets (called "agregados") available within the category of "Censo Demografico".
pt: Vamos dar uma olhada nos conjuntos de dados (chamados "agregados") disponíveis dentro da categoria de "Censo Demográfico".

source: Again for population projections
pt: Novamente para projeções populacionais

source: Downloading data
pt: Extraindo dados

source: Before downloading the data, it may be useful to look at the metadata of the dataset we are interested in.
pt: Antes de baixar os dados, pode ser útil olhar para os metadados do conjunto de dados que estamos interessados.

source: To actually download the data after chosing the dataset, we can use the ``FetchData`` class, which will fetch the data and make it available both in JSON format and Dataframe as exemplified below.
pt: Para baixar os dados depois de escolher o conjunto de dados, podemos usar a classe `FetchData`, que irá buscar os dados e disponibilizá-los tanto em formato JSON quanto em Dataframe, conforme exemplificado abaixo.

source: Using the SIDRA endpoint
pt: Usando o endpoint SIDRA

source: IBGE also has a simpler API at https://api.sidra.ibge.gov.br that PySUS also gives access through a simple function. Below we have table 200, which is a sample from the resident population. classification ``2`` is sex, of which I am fetching all categories: ``total``, ``Homens``, and ``Mulheres``. Terrotorial level 6 is municipality.
pt: O IBGE também possui uma API mais simples em https://api.sidra.ibge.gov.br que o PySUS também acessa através de uma função simples. Abaixo temos a tabela 200, que é uma amostra da população residente. A classificação 2 é o sexo, do qual estou buscando todas as categorias: total, Homens e Mulheres. O nível territorial 6 é o município.

source: Suppose we just wanted a single municipality, ``Balneário Rincão (SC)``: Unfortunately for this one there is no data available, thus the ``...`` in the column ``Valor``. Try another one.
pt: Suponha que quiséssemos apenas um município, `Balneário Rincão (SC)`: Infelizmente, para este não há dados disponíveis, portanto, há um `...` na coluna `Valor`. Tente outro município.
