Repository: AlertaDengue/PySUS
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Data Sources
pt_br: Bases de dados

source: Tutorials
pt_br: Tutoriais

source: Loading SINAN data
pt_br: Extração de dados (SINAN)

source: Loading SIM data
pt_br: Extração de dados (SIM)

source: Loading SIA data
pt_br: Extração de dados (SIA)

source: LOADING PNI data
pt_br: Extração de dados (PNI)

source: Analyzing Dengue data
pt_br: Análise de dados (Dengue)

source: Analyzing Chikungunya data
pt_br: Análise de dados (Chikungunya)

source: Analyzing Zika data
pt_br: Análise de dados (Zika)

source: Downloading COVID data from ESUS
pt_br: Extração de dados de COVID (ESUS)

source: Downloading Infogripe data
pt_br: Extração de dados (Infogripe)

source: Downloading Infodengue data
pt_br: Extração de dados (Infodengue)

source: Getting Official Statistics
pt_br: Estatísticas Oficiais

source: Welcome to PySUS's documentation!
pt_br: Bem-vindo(a) à documentação do PySUS

source: PySUS is a library which is a collection of helper codes for people which need to analyze data from SUS (Brazilian Universal Health System). Contributions are welcome!
pt_br: PySUS é uma biblioteca que consiste em uma coleção de códigos auxiliares para pessoas que precisam analisar dados do SUS (Sistema Único de Saúde). Contribuições são bem-vindas!

source: Contents:
pt_br: Conteúdo:

source: Indices and tables
pt_br: Tabelas e índices
