Repository: AlertaDengue/PySUS
Catalog: docs/source/locale/*/LC_MESSAGES/SINAN.po
Languages: pt

source: Downloading data from the SINAN database
pt: Baixando dados do banco de dados do SINAN

source: SINAN is a database of reported cases of certain diseases that Brazilian law requires to be reported. Unfortunately the data available for free download, corresponds only to the investigated cases not the totality of the reported cases. Nevertheless it's an interesting dataset.
pt: SINAN é um banco de dados de casos notificados de certas doenças que a lei brasileira exige que sejam reportadas. Infelizmente, os dados disponíveis para download gratuito correspondem apenas aos casos investigados, não à totalidade dos casos reportados. No entanto, é um conjunto de dados interessante.

source: To find out what are these diseases, we can use PySUS:
pt: Para descobrir quais são essas doenças, podemos usar o PySUS:

source: These diseases are available in countrywide tables, so if we want to see the cases of ``Chagas`` disease in the state of Minas Gerais, first we can check which years are available:
pt: Essas doenças estão disponíveis em tabelas de todo o país, então, se quisermos ver os casos de doença de `Chagas` no estado de Minas Gerais, primeiro podemos verificar quais anos estão disponíveis:

source: We can also check when it was last updated for every disease, and if the table is preliminary or final.
pt: Também podemos verificar quando foi a última atualização para cada doença e se a tabela é preliminar ou final.

source: We can see, that we have data in final form, from 2000 until 2019, and preliminary data for 2020. Now we can download it:
pt: Podemos ver que temos dados em forma final, de 2000 até 2019, e dados preliminares para 2020. Agora podemos baixá-los:

source: Downloading large files
pt: Baixando arquivos grandes

source: Some SINAN files can be quite large and can take a bit longer to download and convert. As the default behavior is to download data in chunks, some folders may contain lots of parquet chunks
pt: Alguns arquivos do SINAN podem ser bastante grandes e podem demorar um pouco mais para serem baixados e convertidos. Como o comportamento padrão é baixar dados em blocos, algumas pastas podem conter muitos pedaços de parquet.

source: The cases of dengue where downloaded to multiple chunks to the directory above
pt: Os casos de dengue foram baixados em vários pedaços para o diretório acima

source: Decoding the age in SINAN tables
pt: Decodificando a idade nas tabelas do SINAN

source: In SINAN the age comes encoded. PySUS can decode the age column ``NU_IDADE_N`` into any of these units: years, months, days, or hours.
pt: No SINAN, a idade vem codificada. O PySUS pode decodificar a coluna de idade `NU_IDADE_N` em qualquer uma dessas unidades: anos, meses, dias ou horas.

source: We can easily convert dates and numerical fields in the dataframe:
pt: Podemos facilmente converter datas e campos numéricos no dataframe:

source: Let's convert the age to years and save it on a different column.
pt: Vamos converter a idade para anos e salvá-la em uma coluna diferente.

source: Saving the Modified data
pt: Salvando os dados modificados

source: We can save our dataframe in any format we wish to avoid having to redo this analysis next time. If we want to keep only the data from the state of Minas Gerais we need to filter the table using the UF code ``31``.
pt: Pode-se salvar nosso conjunto de dados em qualquer formato que desejarmos para evitar ter que refazer esta análise na próxima vez. Se quisermos manter apenas os dados do estado de Minas Gerais, precisamos filtrar a tabela usando o código UF `31`.
