Repository: AlertaDengue/PySUS
Catalog: docs/source/locale/*/LC_MESSAGES/locale/tutorials.po
Languages: pt

source: Tutorials
pt: Tutoriais

source: PySUS includes some Jupyter notebooks in its distribution package to serve as tutorials.
pt: O PySUS inclui alguns notebooks Jupyter em seu pacote de distribuição para servir como tutoriais.

source: Working with SINASC databases
pt: Trabalhando com a base de dados SINASC

source: SINASC is the national registry of live births. With PySUS, You can download SINASC tables directly and have them as dataframes to integrate in your analysis. `See this notebook. <https://github.com/AlertaDengue/PySUS/blob/master/pysus/Notebooks/Analyzing%20SINASC%20Data.ipynb>`_
pt: SINASC é o registro nacional de nascidos vivos. Com o PySUS, você pode fazer o download direto das tabelas do SINASC e tê-las como dataframes para integrar em sua análise. Veja este notebook. `<https://github.com/AlertaDengue/PySUS/blob/master/pysus/Notebooks/Analyzing%20SINASC%20Data.ipynb>`_

source: Working with SINAN files
pt: Trabalhando com arquivos SINAN

source: SINAN is the national registry of cases for diseases of required reporting. PySUS offers the possibility of downloading records of individual cases selected for futher laboratory investigation, not the entirety of the reported cases. To see how to download these data look at the example notebook provided.
pt: SINAN é o registro nacional de casos de doenças de notificação obrigatória. O PySUS oferece a possibilidade de baixar registros de casos individuais selecionados para investigação laboratorial adicional, não a totalidade dos casos notificados. Para saber como baixar esses dados, consulte o notebook de exemplo fornecido.

source: The sinan module in the preprocessing package can load SINAN files from DBF, returning a pandas DataFrame fixing the typing of some columns.
pt: O módulo sinan no pacote de pré-processamento pode carregar arquivos SINAN do formato DBF, retornando um pandas DataFrame corrigindo a tipagem de algumas colunas.

source: It also offers geocoding capabilities which attributes geographical coordinates to every notified case in a SINAN Dataframe. You can use your Google API KEY to avoid Google's free limits. To do this just create an environment variable called GOOGLE_API_KEY. Warning: This can take a long time! and can stop halfway through, due to connections timing out. But PySUS creates knows how to restart from the last geocoded address. `See this notebook. <https://github.com/AlertaDengue/PySUS/blob/master/docs/source/SINAN.ipynb>`_
pt: Ele também oferece capacidades de geocodificação que atribuem coordenadas geográficas a cada caso notificado em um DataFrame do SINAN. Você pode usar sua chave API do Google para evitar os limites gratuitos do Google. Para isso, basta criar uma variável de ambiente chamada GOOGLE_API_KEY. Aviso: isso pode levar muito tempo! e pode parar no meio do caminho, devido a conexões expirando. Mas o PySUS sabe como reiniciar a partir do último endereço geocodificado. Veja este notebook. `<https://github.com/AlertaDengue/PySUS/blob/master/docs/source/SINAN.ipynb>`_

source: Working with SIH DATA
pt: Trabalhando com a base de dados SIH

source: SIH is DATASUS' Hospital information system and it contains detailed information about hospitalizations. SIH Data can also be downloaded directly with PySUS. `See this notebook. <https://github.com/AlertaDengue/PySUS/blob/master/pysus/Notebooks/Analyzing%20SIH.ipynb>`_
pt: SIH é o sistema de informações hospitalares do DATASUS e contém informações detalhadas sobre internações hospitalares. Os dados do SIH também podem ser baixados diretamente com o PySUS. Veja este notebook. `<https://github.com/AlertaDengue/PySUS/blob/master/pysus/Notebooks/Analyzing%20SIH.ipynb>`_
